Revit 2016 API
SolidCurveIntersection.GetEnumerator Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual IEnumerator<Curve> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of Curve)
Visual C++
public:
virtual IEnumerator<Curve^>^ GetEnumerator()
Return Value
An IEnumerator(Autodesk.Revit.DB.Curve) object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace